export default {
  title: '璀璨黄河',
  logo: 'N',
  author: 'BY nxmin',
  whiteList: ['/login', '/404', '/401', '/lock'],
  lockPage: '/lock',
  info: {
    title: '璀璨黄河，文化传承',
    list: [
      '璀璨黄河是一个基于“璀璨黄河，文化传承”小程序而搭建的后台管理系统',
      '后台管理系统可以方便地管理文章内容，管理用户的权限，同时支持观看用户喜好的文章。',
      '管理员可以通过后台管理系统轻松地对文章进行更新和维护，确保内容的及时性和准确性。',
      '后台管理系统界面简洁明了，操作简单便捷，让开发者能够高效管理小程序的内容'
    ]
  },
  wel: {
    title: 'nx-admin 通用管理系统快速开发框架',
    list: [
      'vuex本地持久化存储,封装h5的sessionStorage和localStorage',
      '加入了本地离线的包引入方法去引入vue，vue-router等第三方包',
      '支持SSR服务端渲染(express)',
      '支持阿里巴巴图标库在线调用，自动同步图标',
      '支持iframe嵌套第三方网站',
      '支持js动态可配CRUD和FORM,节约大量开发成本，配置字典接口自动匹配字典',
      '支持多种登录方式,本地验证码校验和服务端验证码校验',
      '全局错误日志记录',
      'scss模块化开发',
      '增加系统管理模板(用户管理,角色管理,菜单管理——基于本框架的crud组件自动生成)',
      '打包后docker一键部署脚本基于nginx镜像（具体的可以修改./src/docker/Dockerfile）'
    ]
  }
}
